print("                          年龄计算2.0 编写于 2020.07.26 BY Bedrock")

名字=input("首先，请问我怎么称呼你？")
print(名字,'你好，我可以帮你算年龄哦！')
今年=input("请告诉我今年是哪年？")
出生年份=input("你哪年出生的?")
print(名字,"你今年",int(今年)-int(出生年份),"岁了")


#print("int(old)的类型",type(  int   (old)   )    )
#print("3的类型",type(3))


几年后=input("你想知道在几年后你多少岁吗？")
几年后几岁 = int(今年)-int(出生年份) + int(几年后)
print(名字,几年后,"年",几年后几岁,"岁了")
未来年份=input("你想知道在哪年你多少岁吗？请输入年份")
print("在",未来年份,"年，你",int(未来年份)-int(出生年份),"岁了")
#BY  Bedrock    2020.7.26
